app/views/projects/index.html.erb

SELECT "collaborations".* FROM "collaborations" WHERE "collaborations"."project_id" = $1  [["project_id", 1]]
---
                  <td><%= project.user.username %></td>
                  <td> <% project.collaborations.each do |collaboration| %>