app/views/projects/show.html.erb

      <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
        <p class="center"><button type="button" class="btn btn-info btn-lg center" onclick="startActivity(<%= User.find_by(:username => cookies[:username]).id %>,<%= @project.id %>)">Start Activity</button>     - | -     <button id="stop-activity-btn" type="button" class="btn btn-warning btn-lg center" onclick="stopActivity()">Stop Activity</button></p>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "aaaa"], ["LIMIT", 1]]