app/controllers/projects_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "projects" ("title", "description", "status", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "new project"], ["description", "create a lot of projects"], ["status", "incomplete"], ["created_by", 1], ["created_at", 2017-07-17 13:27:03 UTC], ["updated_at", 2017-07-17 13:27:03 UTC]]
---
	def create
		@user = User.find(cookies[:id])
		params[:project][:created_by] = cookies[:id]
		params[:project][:status] = "incomplete"
		@project = Project.new(params.require(:project).permit(:created_by,:title, :description,:status))
		if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		if !!cookies[:username]
			@project = Project.find(params[:id])