app/controllers/timelogs_controller.rb

	def index
		@timelogs = Timelog.all
---
SELECT "timelogs".* FROM "timelogs"

	def create
		puts params
		@timelog = Timelog.new(:user_id => params[:user_id], :project_id => params[:project_id], :log_date => Time.now.utc)
		if @timelog.save
---
INSERT INTO "timelogs" ("user_id", "project_id", "log_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["project_id", 1], ["log_date", 2017-07-17 13:27:25 UTC], ["created_at", 2017-07-17 13:27:25 UTC], ["updated_at", 2017-07-17 13:27:25 UTC]]

	def update
		@timelog = Timelog.find(params[:id])
		puts @timelog.inspect
		if !!params[:timelog]
			if @timelog.update(note: params[:timelog][:note])
---
SELECT  "timelogs".* FROM "timelogs" WHERE "timelogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "timelogs" SET "total_time" = $1, "updated_at" = $2 WHERE "timelogs"."id" = $3  [["total_time", "00:00:11"], ["updated_at", 2017-07-17 13:27:37 UTC], ["id", 1]]