app/controllers/users_controller.rb

	def create
		@user = User.new(params.require(:user).permit(:username, :first_name, :last_name, :password, :password_confirmation, :role))
		if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "password", "created_at", "updated_at", "role") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first_name", "a"], ["last_name", "a"], ["username", "aaaa"], ["password", "aaaa"], ["created_at", 2017-07-17 13:25:48 UTC], ["updated_at", 2017-07-17 13:25:48 UTC], ["role", "employee"]]

	def show
		if !!cookies[:username]
			@projects = Project.where(created_by: params[:id])
			@collaborations = Project.joins(:collaborations).where("collaborations.collaborator_id" => params[:id])
			puts "this is #{@collaborations}"
			@user = User.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."created_by" = $1  [["created_by", 1]]
SELECT "projects".* FROM "projects" INNER JOIN "collaborations" ON "collaborations"."project_id" = "projects"."id" WHERE "collaborations"."collaborator_id" = $1  [["collaborator_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@user = User.find_by(id: params[:id])
		if !cookies[:username]
			redirect_to user_path(:msg => "You are no longer logged in, please log in")
		elsif @user.update(password: params[:user][:password], password_confirmation: params[:user][:password_confirmation])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password", "bbbb"], ["updated_at", 2017-07-17 13:26:28 UTC], ["id", 1]]

	def login
		cookies.delete :username
		cookies.delete :role
		cookies.delete :id
		@user = User.find_by username: params[:user][:username].to_s
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "aaaa"], ["LIMIT", 1]]